In [2]:
#Indexing & Selection & Filtering in Pandas

import pandas as pd
import numpy as np

In [3]:
obj=pd.Series(np.arange(5),
              index=["a","b","c","d","e"])
print(obj)

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [4]:
obj[obj<2]

a    0
b    1
dtype: int64

In [5]:
obj["a":"c"]

a    0
b    1
c    2
dtype: int64

In [6]:
obj["b":"c"]=5
obj

a    0
b    5
c    5
d    3
e    4
dtype: int64

In [7]:
data=pd.DataFrame(
    np.arange(16).reshape(4,4),
    index=["London","Paris",
           "Berlin","Istanbul"],
    columns=["one","two","three","four"])
data

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [8]:
data["two"]

London       1
Paris        5
Berlin       9
Istanbul    13
Name: two, dtype: int64

In [9]:
data[["one","two"]]

          one  two
London      0    1
Paris       4    5
Berlin      8    9
Istanbul   12   13

In [10]:
data[data["four"]>5]

          one  two  three  four
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [11]:
data.iloc[1]

one      4
two      5
three    6
four     7
Name: Paris, dtype: int64

In [12]:
data.iloc[1,[1,2,3]]

two      5
three    6
four     7
Name: Paris, dtype: int64

In [13]:
data.iloc[[1,3],[1,2,3]]

          two  three  four
Paris       5      6     7
Istanbul   13     14    15

In [14]:
data.loc["Paris",["one","two"]]

one    4
two    5
Name: Paris, dtype: int64

In [15]:
data.loc[:"Paris","four"]

London    3
Paris     7
Name: four, dtype: int64